src/cf/src/Catalogs/ТелеграмСервис/ТелеграмСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмСервис</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВходящегоОбновления</name>
    <type>
      <types>EnumRef.ТелеграмВидыВходящихОбновлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийТекстАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборыУсловийАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкиАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВходящийТекст</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВходящиеДанные</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыУсловий</name>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработки</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ТелеграмОбработка</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Enums/ТелеграмСтатусыИспользования/ТелеграмСтатусыИспользования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСтатусыИспользования</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>Выключен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТелеграмВидыВходящихОбновлений/ТелеграмВидыВходящихОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмВидыВходящихОбновлений</name>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>ОтветКонтекстнойКлавиатуры</name>
    <comment>CallbackQuery</comment>
  </enumValues>
  <enumValues>
    <name>ВстроенныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ВыбранныйЛинейныйРезультат</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ТелеграмСервис/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
		
		Если ПометкаУдаления Тогда
			Статус = Перечисления.ТелеграмСтатусыИспользования.Выключен;
		КонецЕсли;
		
		Если ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.Сообщение Тогда
			
			Если ВходящийТекст.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не задан входящий текст.'"));
				Отказ = Истина;
			Иначе
				ВходящийТекстАвто = "";
				Для Каждого ТекСтрока Из ВходящийТекст Цикл
					Если ВходящийТекстАвто <> "" Тогда
						ВходящийТекстАвто = ВходящийТекстАвто + "; ";
					КонецЕсли;
					ВходящийТекстАвто = ВходящийТекстАвто + ТекСтрока.ВидСравнения + " " + ТекСтрока.Значение;
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры Тогда
			
			Если ВходящиеДанные.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заданы входящие данные.'"));
			Иначе
				ВходящийТекстАвто = "";
				Для Каждого ТекСтрока Из ВходящиеДанные Цикл
					Если ВходящийТекстАвто <> "" Тогда
						ВходящийТекстАвто = ВходящийТекстАвто + "; ";
					КонецЕсли;
					ВходящийТекстАвто = ВходящийТекстАвто + ТекСтрока.ВидСравнения + " " + ТекСтрока.Значение;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		НаборыУсловийАвто = НаборыУсловий.Количество();
		ОбработкиАвто = ЭтотОбъект.Обработки.Количество();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
